<template>
    <div  v-if="show" class="so-pop-wanfa modal publicDialog">
        <div class="m_content">
            <h2>北京PK10游戏玩法<a @click="close"></a></h2>
            <div class="content">
                <div class="playtext">
                    <h3>一、开奖与结束时间</h3>
                    <p>每日09:02-23:55，5 分钟一期，全天共179期。</p>
                    <h3>二、两面玩法</h3>
                    <h4>冠亚和：冠军车号＋亚军车号＝冠亚和值（为3~19)</h4>
                    <p>冠亚和大：“冠亚和值”大于或等于12时投注“大”的注单视为中奖，其余视为不中奖。</p>
                    <p>冠亚和小：“冠亚和值”小于或等于11时投注“小”的注单视为中奖，其余视为不中奖。</p>
                    <p>冠亚和单：“冠亚和值”为单视为投注“单”的注单视为中奖，其余视为不中奖。</p>
                    <p>冠亚和双：“冠亚和值”为双视为投注“双”的注单视为中奖，其余视为不中奖。</p>
                    <h4>冠军～第十名</h4>
                    <p>大、小：开出之号码大于或等于6为大，小于或等于5为小。</p>
                    <p>单、双：号码为双数叫双，如4、8；号码为单数叫单，如5、9。</p>
                    <h4>冠军～第五名 龙虎</h4>
                    <p>冠军 龙/虎：“第一名”车号大于“第十名”车号视为【龙】中奖、反之小于视为【虎】中奖，其余情形视为不中奖。</p>
                    <p>亚军 龙/虎：“第二名”车号大于“第九名”车号视为【龙】中奖、反之小于视为【虎】中奖，其余情形视为不中奖。</p>
                    <p>第三名 龙/虎：“第三名”车号大于“第八名”车号视为【龙】中奖、反之小于视为【虎】中奖，其余情形视为不中奖。</p>
                    <p>第四名 龙/虎：“第四名”车号大于“第七名”车号视为【龙】中奖、反之小于视为【虎】中奖，其余情形视为不中奖。</p>
                    <p>第五名 龙/虎：“第五名”车号大于“第六名”车号视为【龙】中奖、反之小于视为【虎】中奖，其余情形视为不中奖。</p>
                    <h3>三、冠亚和值玩法</h3>
                    <p>冠亚和值：“冠亚和值”可能出现的结果为3～19， 投中对应“冠亚和值”数字的视为中奖，其余视为不中奖。</p>
                    <h3>四、1-5名玩法</h3>
                    <h4>冠军～第五名</h4>
                    <p>车号指定：每一个车号为一投注组合，开奖结果“投注车号”对应所投名次视为中奖，其余情形视为不中奖。</p>
                    <h3>五、6-10名玩法</h3>
                    <h4>第六名～第十名</h4>
                    <p>车号指定：每一个车号为一投注组合，开奖结果“投注车号”对应所投名次视为中奖，其余情形视为不中奖。</p>
                </div>
            </div>
            <div class="action">
                <a class="ok" @click="close">确定</a>
            </div>
        </div>
    </div>


</template>


<script>
export default {
  name: 'InfoDialog',
  props:[],
  methods:{
    //打开弹窗
    open:function(e){
        this.show = true;
    },
    //关闭弹窗
    close:function(e){
      this.show = false;
    }
  },
  //程序加载完闭时
  mounted:function() {
  },
  data () {
    return {
        show:false
    }
  }
}
</script>
<style scope>
    /* .publicDialog { display: block !important; } */
</style>
