<template>
    
    <div v-if="show" class="so-pop-wanfa modal publicDialog">
        <div class="m_content">
            <h2>{{moduleName || '重庆时时彩'}}玩法说明<a @click="close"></a></h2>
            <div class="content">
                <div class="playtext">
                    <h3>一、开奖与结束时间</h3>
                    <p>{{moduleplay|| '首期开奖时间 00:05，全天120期。10:00 - 22:00，10分钟一期，共72期。22:00 - 01:55，5分钟一期，共48期。'}}</p>
                    <h3>二、两面玩法</h3>
                    <p>总和大小：根据相应单项投注的第一球 ~ 第五球开出的球号大於或等於23为大，小於或等於22为小。</p>
                    <p>总和单双：根据相应单项投注的第一球 ~ 第五球开出的球号数字总和值是双数为总和双，数字总和值是单数为总和单。</p>
                    <p>龙：当期开奖结果“万位”号码大于“个位”的中奖号码。如万位开出9，个位开出2，投注“龙”即为中奖，其余情形视为不中奖。</p>
                    <p>虎：当期开奖结果“万位”号码小于“个位”的中奖号码。如万位开出7，个位开出9，投注“虎”即为中奖，其余情形视为不中奖。</p>
                    <p>和：当期开奖结果“万位”号码等于“个位”的中奖号码。如万位开出1，个位开出1，投注“和”即为中奖，其余情形视为不中奖。</p>
                    <h4>第一球 ~ 第五球：</h4>
                    <p>大小：根据相应单项投注的第一球 ~ 第五球开出的球号大於或等於5为大，小於或等於4为小。</p>
                    <p>单双：根据相应单项投注的第一球 ~ 第五球开出的球号为双数叫双，如2、6；特码为单数叫单，如1、3。</p>
                    <h3>三、1-5 球玩法说明</h3>
                    <p>第一球~第五球：第一球、第二球、第三球、第四球、第五球：指下注的每一球与开出之号码其开奖顺序及开奖号码相同，视为中奖，如第一球开出号码8，下注第一球为8者视为中奖，其余情形视为不中奖。</p>
                    <h3>四、前中后玩法</h3>
                    <p>豹子：中奖号码对应的位置数字都相同。----如中奖号码为000、111、999等，中奖号码的三位数字相同，则投注豹子者视为中奖，其它视为不中奖。</p>
                    <p>顺子：中奖号码对应的位置数字都相连，不分顺序。（数字9、0、1相连）----如中奖号码为123、901、321、546等，中奖号码三位数字相连，则投注顺子者视为中奖，其它视为不中奖。</p>
                    <p>对子：中奖号码的中对应的位置任意两位数字相同。（不包括豹子）----如中奖号码为001，112、696，中奖号码有两位数字相同，则投注对子者视为中奖，其它视为不中奖。如果开奖号码为豹子,则对子视为不中奖。如中奖号码为001，112、696，中奖号码有两位数字相同，则投注对子者视为中奖，其它视为不中奖。</p>
                    <p>半顺：中奖号码对应的位置任意两位数字相连，不分顺序。（不包括顺子、对子。）----如中奖号码为125、540、390、706，中奖号码有两位数字相连，则投注半顺者视为中奖，其它视为不中奖。如果开奖号码为顺子、对子,则半顺视为不中奖。--如中奖号码为123、901、556、233，视为不中奖。</p>
                    <p>杂六：不包括豹子、对子、顺子、半顺的所有中奖号码。----如中奖号码为157，中奖号码位数之间无关联性，则投注杂六者视为中奖，其它视为不中奖。</p>
                </div>
            </div>
            <div class="action">
                <a class="ok" @click="close">确定</a>
            </div>
        </div>
    </div>

</template>


<script>
export default {
  name: 'InfoDialog',
  props:['moduleName', 'moduleplay'],
  methods:{
    //打开弹窗
    open:function(e){
        this.show = true;
    },
    //关闭弹窗
    close:function(e){
      this.show = false;
    }
  },
  //程序加载完闭时
  mounted:function() {
  },
  data () {
    return {
        show:false
    }
  }
}
</script>
<style scope>
    .publicDialog { display: block !important; }
</style>
