<template>
    <div  v-if="show" class="so-pop-wanfa modal publicDialog">
        <div class="m_content">
            <h2>{{moduleName || '江西11选5'}}游戏玩法<a @click="close"></a></h2>
            <div class="content">
                <div class="playtext">
                    <h3>一、开奖与结束时间</h3>
                    <p>{{moduleplay || '每日09:00-23:00，10分钟一期，全天共84期。' }}</p>
                    <h3>二、两面玩法</h3>
                    <p>总和大小: 所有开奖号码数字加总值大于等于31为和大；总和值小于等于29为和小；若总和值等于30为和 (不计算输赢)。</p>
                    <p>总和单双: 所有开奖号码数字加总值为单数叫和单，如11、31；加总值为双数叫和双，如42、30。</p>
                    <p>总和尾数大小: 所有开奖号码数字加总值的尾数，大于或等于5为尾大，小于或等于4为尾小。</p>
                    <p>龙：第一球开奖号码大于第五球开奖号码，如第一球开出10，第五球开出07。</p>
                    <p>虎：第一球开奖号码小于第五球开奖号码，如第一球开出03，第五球开出07。</p>
                    <h4>第一球～第五球</h4>
                    <p>大小：开出的号码大于或等于6为大，小于或等于5为小；开出11号为和 (不计算输赢)。</p>
                    <p>单双：单双：号码为双数叫双，如2、8；号码为单数叫单，如5、9；开出11号为和 (不计算输赢)。</p>
                    <h3>三、第一球～第五球玩法</h3>
                    <p>第一球～第五球：如现场滚球第一个开奖号码为10号，投注第一球为10号则视为中奖，其它号码视为不中奖。</p>
                    <h3>四、连码玩法</h3>
                    <p>一中一: 投注1个号码与当期开奖的5个号码中任1个号码相同，视为中奖。</p>
                    <p>二中二: 投注2个号码与当期开奖的5个号码中任2个号码相同(顺序不限)，视为中奖。</p>
                    <p>三中三: 投注3个号码与当期开奖的5个号码中任3个号码相同(顺序不限)，视为中奖。</p>
                    <p>四中四: 投注4个号码与当期开奖的5个号码中任4个号码相同(顺序不限)，视为中奖。</p>
                    <p>五中五: 投注5个号码与当期开奖的5个号码中5个号码相同(顺序不限)，视为中奖。</p>
                    <p>六中五: 投注6个号码中任5个号码与当期开奖的5个号码相同(顺序不限)，视为中奖。</p>
                    <p>七中五: 投注7个号码中任5个号码与当期开奖的5个号码相同(顺序不限)，视为中奖。</p>
                    <p>八中五: 投注8个号码中任5个号码与当期开奖的5个号码相同(顺序不限)，视为中奖。</p>
                    <p>前二组选: 投注的2个号码与当期开出的5个号码中的前2个号码相同(顺序不限)，视为中奖。</p>
                    <p>前三组选: 投注的3个号码与当期开出的5个号码中的前3个号码相同(顺序不限)，视为中奖。</p>
                </div>
            </div>
            <div class="action">
                <a class="ok" @click="close">确定</a>
            </div>
        </div>
    </div>


</template>


<script>
export default {
  name: 'InfoDialog',
  props:['moduleName', 'moduleplay'],
  methods:{
    //打开弹窗
    open:function(e){
        this.show = true;
    },
    //关闭弹窗
    close:function(e){
      this.show = false;
    }
  },
  //程序加载完闭时
  mounted:function() {
  },
  data () {
    return {
        show:false
    }
  }
}
</script>
<style scope>
    /* .publicDialog { display: block !important; } */
</style>
